[
  {
    "status": "degraded",
    "affectedServices": "LOTUS (old cluster)",
    "summary": "Hosts now being retired from old cluster",
    "date": "2025-01-28T17:00",
    "updates": [
      {
        "date": "2025-01-28T17:00",
        "details": "Expect jobs to run more slowly on old LOTUS cluster now ahead of retirement 18 Feb. Please use new LOTUS2 cluster.",
        "url": "https://www.ceda.ac.uk/news/updates/2025/2025-01-28-jasmin-updates-new-cluster-scratch-conda-removal/"
      }
    ]
  },
  {
    "status": "degraded",
    "affectedServices": "LOTUS (old cluster)",
    "summary": "sci-vm hosts submit to new cluster & standard partitions close Tues 18 Feb",
    "date": "2025-02-18T08:00",
    "updates": [
      {
        "date": "2025-02-26T17:00",
        "details": "Provisional date for closure of partitions on old cluster now 14 March 2025."
      }
    ]
  },
  {
    "status": "degraded",
    "affectedServices": "LOTUS2 (new cluster)",
    "summary": "Limited hosts available for processing",
    "date": "2025-02-17T09:00",
    "updates": [
      {
        "date": "2025-02-24T11:00",
        "details": "Some nodes still failing under heavy load of many jobs: investigation continues. Changes made to scheduler parameters to reduce number of jobs that can be started on each node: may result in longer wait time before jobs start. To help, please use array jobs instead of many individual jobs. Also DO NOT run 'watch' command with Slurm jobs - detected instances will be killed. Old LOTUS remains open while investigations with new cluster continue. Apologies for any inconvenience."
      },
      {
        "date": "2025-02-27T08:45",
        "details": "Remedial intervention now planned for Tuesday 4th March 2025, requiring draining of LOTUS2 cluster. Reservation is now in place to start at 05:00 on that day, so users submitting long jobs now will see their jobs scheduled to start after the end of the reservation period."
      },
      {
        "date": "2025-03-04T10:00",
        "details": "Update of the Slurm RPMs on LOTUS2 has been completed and the reservation released. Jobs are not yet running. We will be monitoring the cluster and scheduler and if all seems well, we will gradually increase the number of jobs that can be started during each scheduler cycle. It is likely that other changes to the configuration will take place in the coming weeks. Thanks for your patience and apologies for the inconvenience."
      }
    ]
  },
  {
    "status": "down",
    "affectedServices": "All CEDA and JASMIN services",
    "summary": "Regular scheduled maintenance day",
    "date": "2025-04-29T00:01",
    "updates": [
      {
        "date": "2025-02-28T13:00",
        "details": "Advance notice of regular scheduled maintenance day. Please plan your work to minimise disruption."
      }
    ]
  }
]
