[
  {
    "status": "resolved",
    "affectedServices": "All CEDA and JASMIN services",
    "summary": "Advance notice of next regular scheduled maintenance day",
    "date": "2025-11-04T00:01",
    "updates": [
      {
        "date": "2025-07-31T09:00",
        "details": "Advance notice of scheduled maintenance day on Tues 4th November 2025. Please plan your work to minimise disruption."
      },
      {
        "date": "2025-11-04T15:00",
        "details": "Scheduled maintenance now completed, services operating normally. Reservations on LOTUS & ORCHID now lifted, jobs resumed running. Please report any further issues."
      }
    ]
  },
  {
    "status": "at risk",
    "affectedServices": "All CEDA and JASMIN Services",
    "summary": "No physical access to data centre building",
    "date": "2025-11-14T08:00",
    "updates": [
      {
        "date": "2025-10-17T12:00",
        "details": "There will be no physical access to the building housing the JASMIN and CEDA services hardware on Friday 14th November 2025. No disruption is expected but in the event of physical equipment failure repairs will not be possible on the day."
      }
    ]
  },
  {
    "status": "down",
    "affectedServices": "Tape services",
    "summary": "Tape mount issues with tape library.",
    "date": "2025-10-30T12:15",
    "updates": [
      {
        "date": "2025-10-30T12:15",
        "details": "Tape mount issues causing delays to recalls. Ingest currently able to continue but this may change. Investigation ongoing."
      },
      {
        "date": "2025-10-30T17:00",
        "details": "Ongoing issues mean that ingest and recalls are going to be stopped shortly. PLEASE DO NOT USE ET/JDMA until further notice here. Ingest to NLDS (using only the object store cache) should be unaffected."
      },
      {
        "date": "2025-11-03T12:00",
        "details": "Tape services still down. Awaiting further information from tape services team. NLDS should continue to be unaffected."
      },
      {
        "date": "2025-11-04T15:00",
        "details": "Tape services remain unavailable. Awaiting further information from tape services team. NLDS should continue to be unaffected."
      }
    ]
  }
]