[
  {
    "status": "down",
    "affectedServices": "All CEDA and JASMIN services",
    "summary": "Advance notice of next regular scheduled maintenance day",
    "date": "2026-01-27T00:01",
    "updates": [
      {
        "date": "2025-11-05T17:00",
        "details": "Advance notice of scheduled maintenance day on Tues 27th January 2026. Please plan your work to minimise disruption."
      }
    ]
  },
  {
    "status": "degraded",
    "affectedServices": "CEDA Archive",
    "summary": "Technical problem affecting access to disk storage systems.",
    "date": "2025-11-18T12:30",
    "updates": [
      {
        "date": "2025-11-18T12:30",
        "details": "We currently have a technical problem affecting at least the archive disk volumes, possibly other disk systems as well, so ALL disk storage systems are potentially affected. The team is currently investigating as a matter of urgency. So far we believe this is unrelated to Cloudflare issues reported in the media."
      },
      {
        "date": "2025-11-18T14:25",
        "details": "The cause of the issue has been identified and stopped. Some data in the CEDA archive is currently unavailable. We will provide a detailed update as to which data, and a timeline to restoration, as soon as possible. Please note all other CEDA and JASMIN remain operational."
      },
      {
        "date": "2025-11-20T11:00",
        "details": "As part of the migration of data in the CEDA archive, a mistake was made which resulted in some data being deleted from the archive. As a result of this incident, approximately 5 Petabytes of data have been deleted from the archive. We are beginning the process of prioritising data for recovery from backup.",
        "url": "https://www.ceda.ac.uk/news/updates/2025/2025-11-19-archive-incident/"
      },
      {
        "date": "2025-11-24T14:00",
        "details": "We have given an update on the incident and answered some common asked questions, including how to request which data you’d like to be a priority for recovery.",
        "url": "https://www.ceda.ac.uk/news/updates/2025/2025-11-24-incident-update/"
      }
    ]
  },
  {
    "status": "resolved",
    "affectedServices": "Globus data transfer service",
    "summary": "Node reboots to clear stuck processes.",
    "date": "2025-11-24T14:40",
    "updates": [
      {
        "date": "2025-11-24T14:40",
        "details": "Following some (now resolved) issues with SOF storage last week, Globus nodes are being rebooted this afternoon to clear stuck processes. Transfer tasks currently waiting should resume in due course."
      },
      {
        "date": "2025-11-24T15:20",
        "details": "Globus transfer nodes now rebooted, transfers now running again."
      }
    ]
  }
]
