[
  {
    "status": "degraded",
    "affectedServices": "LOTUS (old cluster)",
    "summary": "Hosts now being retired from old cluster",
    "date": "2025-01-28T17:00",
    "updates": [
      {
        "date": "2025-01-28T17:00",
        "details": "Expect jobs to run more slowly on old LOTUS cluster now ahead of retirement 18 Feb. Please use new LOTUS2 cluster.",
        "url": "https://www.ceda.ac.uk/news/updates/2025/2025-01-28-jasmin-updates-new-cluster-scratch-conda-removal/"
      }
    ]
  },
  {
    "status": "degraded",
    "affectedServices": "LOTUS (old cluster)",
    "summary": "sci-vm hosts submit to new cluster & standard partitions close Tues 18 Feb",
    "date": "2025-02-18T08:00",
    "updates": [
      {
        "date": "2025-02-26T17:00",
        "details": "Provisional date for closure of partitions on old cluster now 14 March 2025."
      }
    ]
  },
  {
    "status": "degraded",
    "affectedServices": "LOTUS2 (new cluster)",
    "summary": "Limited hosts available for processing",
    "date": "2025-02-17T09:00",
    "updates": [
      {
        "date": "2025-03-04T10:00",
        "details": "Update of the Slurm RPMs on LOTUS2 has been completed and the reservation released. Jobs ARE now running. We will be monitoring the cluster and scheduler and if all seems well, we will gradually increase the number of jobs that can be started during each scheduler cycle. It is likely that other changes to the configuration will take place in the coming weeks. Thanks for your patience and apologies for the inconvenience."
      },
      {
        "date": "2025-03-04T16:00",
        "details": "Unfortunately, increasing the number of jobs that can be restarted during scheduling has resulted in a problem on LOTUS2. Jobs cannot currently be scheduled. The status of running jobs is not known at this time. Troubleshooting is taking place. Apologies for the inconvenience that this may cause."
      }
    ]
  },
  {
    "status": "down",
    "affectedServices": "All CEDA and JASMIN services",
    "summary": "Regular scheduled maintenance day",
    "date": "2025-04-29T00:01",
    "updates": [
      {
        "date": "2025-02-28T13:00",
        "details": "Advance notice of regular scheduled maintenance day. Please plan your work to minimise disruption."
      }
    ]
  }
]
